os/review.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Operating System Review Questions</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Operating System Review Questions"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-05-21 14:50:56 CST"/>
<meta name="author" content="WANG Xiaolin"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="http://cs2.swfu.edu.cn/org-info-js/org-manual.css" type="text/css">
</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Operating System Review Questions</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 General</a></li>
<li><a href="#sec-2">2 Process management</a></li>
<li><a href="#sec-3">3 Memory management</a></li>
<li><a href="#sec-4">4 File system</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> General</h2>
<div class="outline-text-2" id="text-1">

<ol>
<li>What's an OS?
</li>
<li>System calls
</li>
<li>Interrupts
</li>
<li>Multi-tasking
</li>
</ol>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Process management</h2>
<div class="outline-text-2" id="text-2">

<ol>
<li>Process state transition 
</li>
<li>IPC
<ul>
<li>Two ways of IPC
</li>
<li>Get a clear idea about how to use pipe()
</li>
<li>signals
</li>
</ul>

</li>
<li>fork()
<ul>
<li>What's happened after fork()?
</li>
<li>anything is shared or not?
</li>
</ul>

</li>
<li>A process is a unit of resource ownership, while a thread is a unit of scheduling.
</li>
<li>What's a <i>critical region</i>? A solution to the critical region problem must satisfy
     three conditions. 
</li>
<li>Semaphore, mutex
<ul>
<li>Go through all the examples in the lecture slides
</li>
<li>The 4 conditions to hold for a deadlock
</li>
</ul>

</li>
<li>deadlock (four conditions)
</li>
<li>140 priorities of process scheduling in Linux
</li>
<li>Linux 2.6 scheduling algorithm? O(1)?
</li>
</ol>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Memory management</h2>
<div class="outline-text-2" id="text-3">

<ol>
<li>virtual memory
</li>
<li>Two ways of virtual memory implementation?
</li>
<li>Heap vs. stack
</li>
<li>paging
</li>
<li>thrashing
</li>
<li>LRU page replacement algorithm
</li>
</ol>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> File system</h2>
<div class="outline-text-2" id="text-4">

<ol>
<li>inode
</li>
<li>hard link vs. soft link
</li>
<li>Two ways of free blocks tracking?
</li>
<li>Fast symbolic link?
</li>
<li>FAT and memory usage
</li>
<li>Why open() returns a FD rather than a inode number?
</li>
<li>File systems' functionality
</li>
</ol>

</div>
</div>
</div>

<div id="postamble">
<p class="author">Author: WANG Xiaolin (<a href="mailto:wx672ster@gmail.com">wx672ster@gmail.com</a>)</p>
<p class="date">Date: 2013-05-21 14:50:56 CST</p>

</div>
</body>
</html>
